{
    "sessions": [
        {
            "slug": "azure-config",
            "meetup": "Meetup December 2023",
            "timeZone": "UTC+01:00 Europe/Amsterdam",
            "date": "7 December 2023",
            "startTime": "18:30",
            "endTime": "19:15",
            "title": "Azure Configuration management: shipping features without getting angry emails",
            "description": "Features get added to applications all the time, as developers we try our best to make an educated guess on how users will react to the changes. Sometimes this doesn’t work out and we receive angry emails about the made changes.             Join us in this session to learn how feature flags can be used to ship features without angry emails. We will cover implementing and fine-tuning feature flags, discuss various approaches, and take a deep dive into the tools that Azure offers.",
            "speakers": [{
                "name": "Maarten Grootoonk",
                "title": "Senior Software Engineer @ Sopra Steria",
                "imageUrl": "/images/speaker/maarten-grootoonk.jpg",
                "socials": [
                    {
                        "icon": "fa-linkedin",
                        "url": "https://www.linkedin.com/in/maarten-grootoonk/"
                    }
                ]
            }]
        },
        {
            "slug": "extra-id",
            "meetup": "Meetup December 2023",
            "timeZone": "UTC+01:00 Europe/Amsterdam",
            "date": "7 December 2023",
            "startTime": "19:15",
            "endTime": "20:00",
            "title": "Microsoft Entra External ID: easy authentication from your app to your API",
            "description": "Save yourself and your users time with Microsoft Entra External ID (formerly known as Azure Active Directory B2C) authentication. Microsoft Entra External ID provides built-in support for multiple identity providers, such as Google and Apple ID. With just a few clicks in Azure, and a few lines of code in your app, your users can sign in, sign out and a lot of other useful things. You don’t even have to worry about creating a login page! In this session, you will learn the basics of Entra External ID, its benefits, and how to integrate it into your app and Azure. This includes a walkthrough on setting up Entra External ID and a demonstration of how you can log in with a .NET MAUI app and access an API.",
            "speakers": [{
                "name": "Anjuli Jhakry",
                "title": "Software Developer @ 4DotNet",
                "imageUrl": "/images/speaker/anjuli-jhakry.jpg",
                "socials": [
                    {
                        "icon": "fa-twitter",
                        "url": "https://twitter.com/ALJhakry"
                        },
                    {
                    "icon": "fa-linkedin",
                    "url": "https://www.linkedin.com/in/anjuli-jhakry-1b8169116/"
                    }
                ]
            }],
            "hideReadMore": false
        }
    ]
}

